{ "translations": {
    "Built-in CODE Server" : "خادوم كولابورا CODE مُدمج",
    "Collabora Online - Built-in CODE Server" : "كولابورا على الوب. خادوم كولابورا CODE مُدمج",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "نسخة خادوم مُدمج لتطوير كولابورا على الوب (CODE) للاختبار المحلي في بيئة غير فعلية. ",
    "This app has to be installed and used together with the **[Collabora Online](https://apps.nextcloud.com/apps/richdocuments)** app.\n\nCollabora Online is a powerful LibreOffice-based online office suite with collaborative editing, which supports all major documents, spreadsheet and presentation file formats and works together with all modern browsers.\n\nThis app provides a built-in server with all of the document editing features of Collabora Online. Easy to install, for personal use or for small teams. A bit slower than a standalone server and without the advanced scalability features.\n\nThe download is rather big so it is possible you experience a time-out when using the web interface. You can use the OCC command line tool to install the built-in server:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nWhere `wwwrun` is the user of your web server. This is ```www-data``` on Debian, Ubuntu and derivatives, `wwwrun` on SUSE based distributions, `apache` on Red Hat/Fedora and `http` on Arch linux and derivatives.\n\nUpdates can be done like this:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nOf course, alternatively you could increase memory usage and PHP time-outs by default, see the [Nextcloud documentation.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)" : "هذا التطبيق يتوجب تنصيبه و استخدامه جنباً إلى جنبٍ مع التطبيق **[Collabora Online](https://apps.nextcloud.com/apps/richdocuments)** \n\nكولابورا على الوب هي حزمة برمجية مكتبية مبنية على نظام LibreOffice تدعم التحرير التعاوني للمستندات. وهي تدعم صيغ معظم أنواع المستندات المكتبية و الجداول و العروض الشائعة، ويعمل على معظم المتصفحات الحديثة.\nهذا التطبيق يوفّر خادوماً مُدمجاً بكل مزايا تحرير النصوص التي توفّرها كولابورا على الوب؛ وهو مناسبُ للاستعمال الشخصي و للمجموعات الصغيرة لكنه سيكون بطيئاً بالنسبة لأعداد أكبر من المستخدمين حيث أنه يفتقد إلى مزايا التوسّع المتقدمة.\n\nتحميل التطبيق قد يأخذ وقتاً طويلاً نسبيّاً. لذا، يمكن استعمال أداة سطر الأوامر OCC لتنصيب الخادوم المُدمج كالتالي:\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscodeحيث تمثل 'wwwrun' مُستخدم خادوم الوب في حالة SUSE، و يمكن استبداله بـ 'www-data' في حالة Debian أي Ubuntu و مشتقاته، أو بـ 'apache' في حالة Red Hat/Fedora، أو بـ 'http' في حالة Arch Linux و مشتقاته.  \n\nأما بالنسبة للتحديثات فيمكن إجراؤها كما يلي:\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\nويمكن اختيارياً زيادة الذاكرة المستعملة و زيادة أقصى زمن للاستجابة time-out في PHP. أنظر [Nextcloud documentation.] في:\n(https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)",
    "Your system is ARM64, but you have installed the x86_64 version of the app. Please remove this and" : "نظامك ARM64؛ لكنك قمت بتنصيب نسخة التطبيق الخاصة بـ x86_64. رجاءً أزلها و  ",
    "install the correct version from the Nextcloud App Store." : "نصّب النسخة الصحيحة من متجر تطبيقات نكست كلاود.",
    "Your system is x86_64, but you have installed the ARM64 version of the app. Please remove this and" : "نظامك x86_64؛ لكنك قمت بتنصيب نسخة التطبيق الخاصة بـ ARM64. رجاءً أزلها و ",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "تطبيق كولابورا على الوب مُفعّلٌ عندك. للمزيد من المعلومات و التهيئة، رجاءً أنطر:",
    "Settings > Administration > Collabora Online" : "Settings > Administration > Collabora Online",
    "Built-in CODE server is designed to work with the usual Collabora Online app." : "خادوم كولابورا المُدمج CODE مُصمّمٌ ليعمل مع التطبيق المعتاد لكولابورا على الوب. ",
    "Install it from the Nextcloud App Store." : "نصّبه من متجر تطبيقات نكست كلاود",
    "An error occurred while trying to check your Collabora Online app installation. You may report this error\n                with the tag: <em>richdocuments-EnabledCheckFailed</em>" : "حدث خطأ عند محاولة التحقُّق من تنصيب تطبيق كولابورا على الوب لديك. يمكنك الإبلاغ عن هذا الخطأ باستخدام الوسم:  <em>richdocuments-EnabledCheckFailed</em>"
},"pluralForm" :"nplurals=6; plural=n==0 ? 0 : n==1 ? 1 : n==2 ? 2 : n%100>=3 && n%100<=10 ? 3 : n%100>=11 && n%100<=99 ? 4 : 5;"
}