{ "translations": {
    "Built-in CODE Server" : "Indbygget CODE Server",
    "Collabora Online - Built-in CODE Server" : "Collabora Online - Indbygget CODE Server",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "Indbygget Collabora Online Development Edition (CODE) Server for lokal testning og ikke-produktions brug",
    "This app has to be installed and used together with the **[Collabora Online](https://apps.nextcloud.com/apps/richdocuments)** app.\n\nCollabora Online is a powerful LibreOffice-based online office suite with collaborative editing, which supports all major documents, spreadsheet and presentation file formats and works together with all modern browsers.\n\nThis app provides a built-in server with all of the document editing features of Collabora Online. Easy to install, for personal use or for small teams. A bit slower than a standalone server and without the advanced scalability features." : "Denne app skal installeres og bruges sammen med ** [Collabora Online] (https://apps.nextcloud.com/apps/richdocuments) ** app.\n\nCollabora Online er en kraftfuld LibreOffice-baseret online kontorpakke med samarbejdsredigering, der understøtter alle større dokumenter, regneark og præsentationsfilformater og fungerer sammen med alle moderne browsere.\n\nDenne app giver en indbygget server med alle dokumentredigeringsfunktionerne i Collabora Online. Let at installere, til personlig brug eller til mindre hold. Lidt langsommere end en enkeltstående server og uden avancerede skalerbarhedsfunktioner.",
    "Your system is ARM64, but you have installed the x86_64 version of the app. Please remove this and" : "Dit system er ARM64, men du har installeret x86_64 bit versionen af denne app. Venligst fjern dette og",
    "install the correct version from the Nextcloud App Store." : "installer den korrekte version fra Nextcloud App Store.",
    "Your system is x86_64, but you have installed the ARM64 version of the app. Please remove this and" : "Dit system er x86_64, men du har installeret ARM64 versionen af denne app. Venligst fjern dette og",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "Du har Collabora Online app aktiveret. For mere information og konfiguration, tjek her:",
    "Settings > Administration > Collabora Online" : "Indstillinger > Administration > Collabora Online",
    "Built-in CODE server is designed to work with the usual Collabora Online app." : "Indbygget CODE Server er designet til at arbejde sammen med Collabora Online app.",
    "Install it from the Nextcloud App Store." : "Instaler den fra Nextcloud App Store."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}