{ "translations": {
    "Built-in CODE Server" : "Ενσωματωμένος διακομιστής CODE",
    "Collabora Online - Built-in CODE Server" : "Collabora Online - Ενσωματωμένος διακομιστής CODE",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "Ενσωματωμένος διακομιστής Collabora Online Development Edition (CODE) για τοπικές δοκιμές και όχι για κανονική χρήση",
    "**This app has to be installed and used together with the [Nextcloud Office](https://apps.nextcloud.com/apps/richdocuments) integration app.**\n\nCollabora Online is a powerful LibreOffice-based online office suite with collaborative editing, which supports all major documents, spreadsheet and presentation file formats and works together with all modern browsers.\n\n* This app provides a built-in server with all of the document editing features of Collabora Online.\n* Easy to install, for personal use or for small teams.\n* A bit slower than a standalone server and without the advanced scalability features.\n\n**System Requirements:**\n- Linux running on ```x86-64``` or ```arm64/aarch64```\n- A ```glibc``` based distribution/container (```musl libc``` is **not** supported)\n- Fontconfig (```libfontconfig.so.1```)\n- Additional requirements can be found in [here](https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n\n*The download is rather big so it is possible you will experience a time-out when installing via the web interface.* You can use the OCC command install the built-in server from the command-line instead:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nWhere `wwwrun` is the user of your web server. This is ```www-data``` on Debian, Ubuntu and derivatives, `wwwrun` on SUSE based distributions, `apache` on Red Hat/Fedora and `http` on Arch linux and derivatives.\n\nUpdates can be done like this:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nOf course, alternatively you could increase memory usage and PHP time-outs by default, see the [Nextcloud documentation.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)\n\nAdditional troubleshooting tips can be found [here](https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting)." : "**Αυτή η εφαρμογή πρέπει να εγκατασταθεί και να χρησιμοποιηθεί μαζί με την εφαρμογή ενσωμάτωσης [Nextcloud Office](https://apps.nextcloud.com/apps/richdocuments).**\n\nΤο Collabora Online είναι ένα ισχυρό διαδικτυακό office suite βασισμένο στο LibreOffice με συνεργατική επεξεργασία, που υποστηρίζει όλες τις κύριες μορφές αρχείων εγγράφων, υπολογιστικών φύλλων και παρουσιάσεων και λειτουργεί με όλους τους σύγχρονους browsers.\n\n* Αυτή η εφαρμογή παρέχει έναν ενσωματωμένο διακομιστή με όλες τις λειτουργίες επεξεργασίας εγγράφων του Collabora Online.\n* Εύκολη εγκατάσταση, για προσωπική χρήση ή για μικρές ομάδες.\n* Λίγο πιο αργή από έναν αυτόνομο διακομιστή και χωρίς τις προηγμένες λειτουργίες κλιμάκωσης.\n\n**Απαιτήσεις Συστήματος:**\n- Linux που εκτελείται σε ```x86-64``` ή ```arm64/aarch64```\n- Μια διανομή/container βασισμένη σε ```glibc``` (το ```musl libc``` **δεν** υποστηρίζεται)\n- Fontconfig (```libfontconfig.so.1```)\n- Πρόσθετες απαιτήσεις μπορείτε να βρείτε [εδώ](https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n\n*Η λήψη είναι αρκετά μεγάλη, οπότε είναι πιθανό να αντιμετωπίσετε timeout κατά την εγκατάσταση μέσω της διαδικτυακής διεπαφής.* Μπορείτε να χρησιμοποιήσετε την εντολή OCC για να εγκαταστήσετε τον ενσωματωμένο διακομιστή από τη γραμμή εντολών:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nΌπου `wwwrun` είναι ο χρήστης του web server σας. Αυτός είναι ```www-data``` σε Debian, Ubuntu και παράγωγα, `wwwrun` σε διανομές βασισμένες σε SUSE, `apache` σε Red Hat/Fedora και `http` σε Arch linux και παράγωγα.\n\nΟι ενημερώσεις μπορούν να γίνουν ως εξής:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nΦυσικά, εναλλακτικά θα μπορούσατε να αυξήσετε τη χρήση μνήμης και τα PHP time-outs από προεπιλογή, δείτε την [τεκμηρίωση του Nextcloud.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)\n\nΠρόσθετες συμβουλές αντιμετώπισης προβλημάτων μπορείτε να βρείτε [εδώ](https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting).",
    "Your system is ARM64, but you have installed the x86_64 version of the app. Please remove this and" : "Το σύστημά σας είναι ARM64, αλλά έχετε εγκαταστήσει την έκδοση x86_64 της εφαρμογής. Παρακαλούμε αφαιρέστε την και",
    "install the correct version from the Nextcloud App Store." : "εγκαταστήστε την σωστή έκδοση από το Nextcloud App Store.",
    "Your system is x86_64, but you have installed the ARM64 version of the app. Please remove this and" : "Το σύστημά σας είναι x86_64, αλλά έχετε εγκαταστήσει την έκδοση ARM64 της εφαρμογής. Παρακαλούμε αφαιρέστε την και",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "Έχετε ενεργοποιήσει την εφαρμογή Collabora Online. Για περισσότερες πληροφορίες και διαμόρφωση, παρακαλούμε ελέγξτε:",
    "Administration settings > Nextcloud Office" : "Ρυθμίσεις διαχείρισης > Nextcloud Office",
    "The Built-in CODE Server is designed to work with the Nextcloud Office app." : "Ο ενσωματωμένος διακομιστής CODE σχεδιάστηκε για να λειτουργεί με την εφαρμογή Nextcloud Office.",
    "Install it from the Nextcloud App Store." : "Εγκατάσταση από την αγορά εφαρμογών του Nextcloud.",
    "An error occurred while trying to check your Collabora Online app installation. You may report this error\n                with the tag: <em>richdocuments-EnabledCheckFailed</em>" : "Παρουσιάστηκε σφάλμα κατά την προσπάθεια ελέγχου της εγκατάστασης της εφαρμογής Collabora Online. Μπορείτε να αναφέρετε αυτό το σφάλμα\nμε την ετικέτα: <em>richdocuments-EnabledCheckFailed</em>"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}