{ "translations": {
    "Built-in CODE Server" : "Servidor CODE integrado",
    "Collabora Online - Built-in CODE Server" : "Servidor Collabora Online - CODE integrado",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "Servidor integrado Collabora Online Development Edition (CODE) para pruebas locales y no uso en producción.",
    "This app has to be installed and used together with the **[Collabora Online](https://apps.nextcloud.com/apps/richdocuments)** app.\n\nCollabora Online is a powerful LibreOffice-based online office suite with collaborative editing, which supports all major documents, spreadsheet and presentation file formats and works together with all modern browsers.\n\nThis app provides a built-in server with all of the document editing features of Collabora Online. Easy to install, for personal use or for small teams. A bit slower than a standalone server and without the advanced scalability features." : "Esta app debe ser instalada y usada junto con la **[Collabora Online](https://apps.nextcloud.com/apps/richdocuments)** app.\n\nCollabora Online es una potente suite de oficina basada en LibreOffice con edición colaborativa, que soporta los principales formatos de archivo para documentos, hojas electrónicas y de presentaciones y que funciona en todos los navegadores modernos.\n\nEsta app proporciona un servidor integrado con todas las capacidades de edición de documentos de Collabora Online. Es fácil de instalar, para uso personal o de pequeños grupos de trabajo. Un poco mas lenta que sobre un servidor independiente y sin las avanzadas capacidades de escalabilidad.",
    "Your system is ARM64, but you have installed the x86_64 version of the app. Please remove this and" : "Tu sistema es ARM64, pero has instalado la versión x86_64 de la app. Por favor, desinstala esta e",
    "install the correct version from the Nextcloud App Store." : "instala la versión correcta desde la App Store de Nextcloud.",
    "Your system is x86_64, but you have installed the ARM64 version of the app. Please remove this and" : "Tu sistema es x86_64, pero has instalado la versión ARM64 de la app. Por favor, desinstala esta e",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "Tiene habilitada la app Collabora Online. Para información adicional y configuración, por favor revise:",
    "Settings > Administration > Collabora Online" : "Ajustes > Administración > Collabora Online",
    "Built-in CODE server is designed to work with the usual Collabora Online app." : "El servidor CODE integrado está diseñado para trabajar con la app común Collabora Online.",
    "Install it from the Nextcloud App Store." : "Instálalo desde la tienda de apps de Nextcloud..",
    "An error occurred while trying to check your Collabora Online app installation. You may report this error\n                with the tag: <em>richdocuments-EnabledCheckFailed</em>" : "Se ha encontrado un error mientras que verificaba la instalación de su app Collabora Online. Puede informar acerca de este error\ncon la etiqueta: <em>richdocuments-EnabledCheckFailed</em>"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}