{ "translations": {
    "Built-in CODE Server" : "Servidor CODE integrado",
    "Collabora Online - Built-in CODE Server" : "Servidor Collabora Online - CODE integrado",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "Servidor integrado Collabora Online Development Edition (CODE) para pruebas locales y no uso en producción.",
    "**This app has to be installed and used together with the [Nextcloud Office](https://apps.nextcloud.com/apps/richdocuments) integration app.**\n\nCollabora Online is a powerful LibreOffice-based online office suite with collaborative editing, which supports all major documents, spreadsheet and presentation file formats and works together with all modern browsers.\n\n* This app provides a built-in server with all of the document editing features of Collabora Online.\n* Easy to install, for personal use or for small teams.\n* A bit slower than a standalone server and without the advanced scalability features.\n\n**System Requirements:**\n- Linux running on ```x86-64``` or ```arm64/aarch64```\n- A ```glibc``` based distribution/container (```musl libc``` is **not** supported)\n- Fontconfig (```libfontconfig.so.1```)\n- Additional requirements can be found in [here](https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n\n*The download is rather big so it is possible you will experience a time-out when installing via the web interface.* You can use the OCC command install the built-in server from the command-line instead:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nWhere `wwwrun` is the user of your web server. This is ```www-data``` on Debian, Ubuntu and derivatives, `wwwrun` on SUSE based distributions, `apache` on Red Hat/Fedora and `http` on Arch linux and derivatives.\n\nUpdates can be done like this:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nOf course, alternatively you could increase memory usage and PHP time-outs by default, see the [Nextcloud documentation.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)\n\nAdditional troubleshooting tips can be found [here](https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting)." : "**Esta app debe ser instalada y utilizada en conjunto con la app de integración [Nextcloud Office](https://apps.nextcloud.com/apps/richdocuments).**\n\nCollabora Online es una suite de oficina en línea poderosa basada en LibreOffice con edición colaborativa, que soporta todos los tipos principales de formato de documentos, hojas de cálculo y presentación y funciona de la mano con todos los navegadores modernos.\n\n* Esta app provee un servidor interno con todas características de edición de Collabora Online. \n* Fácil de instalar, para uso personal o equipos pequeños. \n* Un poco más lenta que un servidor independiente y sin las características avanzadas de escalabilidad.\n\n**Requerimientos del Sistema:**\n- Linux ejecutándose en arquitectura ```x86-64``` ó ```arm64/aarch64```\n- Una distribución o un contenedor basado en ```glibc``` (```musl libc``` **no** está soportado)\n- Fontconfig (```libfontconfig.so.1```)\n- Los requerimientos adicionales pueden conseguirse [aqui](https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n\n* La descarga es algo grande, así que es posible que experience una perdida de conexión cuando se instale vía la interfaz web.* Puede utilizar el comando OCC para instalar el servidor interno desde la línea de comandos como alternativa:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nDonde `wwwrun` es el usuario con el cual se ejecuta su servidor web. Suele ser ```www-data``` en Debian, Ubuntu y sus derivados, `wwwrun` en distribuciones basadas en SUSE, `apache` en Red Hat/Fedora y `http` on Arch linux y derivados.\n\nLas actualizaciones se pueden hacer así:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nPor supuesto, puede de manera alternativa incrementar los límites de memoria y los tiempos de espera por defecto, vea la [documentación de Nextcloud.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)\n\nTips para resolución de problemas adicionales también pueden conseguirse [aqui](https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting).",
    "Your system is ARM64, but you have installed the x86_64 version of the app. Please remove this and" : "Tu sistema es ARM64, pero has instalado la versión x86_64 de la app. Por favor, desinstala esta e",
    "install the correct version from the Nextcloud App Store." : "instala la versión correcta desde la App Store de Nextcloud.",
    "Your system is x86_64, but you have installed the ARM64 version of the app. Please remove this and" : "Tu sistema es x86_64, pero has instalado la versión ARM64 de la app. Por favor, desinstala esta e",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "Tiene habilitada la app Collabora Online. Para información adicional y configuración, por favor revise:",
    "Administration settings > Nextcloud Office" : "Configuraciones de Administración > Nextcloud Office",
    "The Built-in CODE Server is designed to work with the Nextcloud Office app." : "El servidor integrado CODE está diseñado para funcionar con la aplicación Nextcloud Office.",
    "Install it from the Nextcloud App Store." : "Instálalo desde la tienda de apps de Nextcloud..",
    "An error occurred while trying to check your Collabora Online app installation. You may report this error\n                with the tag: <em>richdocuments-EnabledCheckFailed</em>" : "Se ha encontrado un error mientras que verificaba la instalación de su app Collabora Online. Puede informar acerca de este error\ncon la etiqueta: <em>richdocuments-EnabledCheckFailed</em>"
},"pluralForm" :"nplurals=3; plural=n == 1 ? 0 : n != 0 && n % 1000000 == 0 ? 1 : 2;"
}