{ "translations": {
    "Built-in CODE Server" : "CODE zerbitzari integratua",
    "Collabora Online - Built-in CODE Server" : "Collabora Online - CODE zerbitzari integratua",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "Collabora Online Development Edition (CODE) zerbitzari integratua, tokiko probetarako eta ekoizpenik gabeko erabilerarako",
    "**This app has to be installed and used together with the [Nextcloud Office](https://apps.nextcloud.com/apps/richdocuments) integration app.**\n\nCollabora Online is a powerful LibreOffice-based online office suite with collaborative editing, which supports all major documents, spreadsheet and presentation file formats and works together with all modern browsers.\n\n* This app provides a built-in server with all of the document editing features of Collabora Online.\n* Easy to install, for personal use or for small teams.\n* A bit slower than a standalone server and without the advanced scalability features.\n\n**System Requirements:**\n- Linux running on ```x86-64``` or ```arm64/aarch64```\n- A ```glibc``` based distribution/container (```musl libc``` is **not** supported)\n- Fontconfig (```libfontconfig.so.1```)\n- Additional requirements can be found in [here](https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n\n*The download is rather big so it is possible you will experience a time-out when installing via the web interface.* You can use the OCC command install the built-in server from the command-line instead:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nWhere `wwwrun` is the user of your web server. This is ```www-data``` on Debian, Ubuntu and derivatives, `wwwrun` on SUSE based distributions, `apache` on Red Hat/Fedora and `http` on Arch linux and derivatives.\n\nUpdates can be done like this:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nOf course, alternatively you could increase memory usage and PHP time-outs by default, see the [Nextcloud documentation.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)\n\nAdditional troubleshooting tips can be found [here](https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting)." : "Aplikazio hau ** [Nextcloud Office] (https://apps.nextcloud.com/apps/richdocuments) ** aplikazioarekin batera instalatu eta erabili behar da.\n\nNextcloud Office LibreOffice-n oinarritutako lineako bulegoko suite indartsua da, lankidetzako edizioarekin. Dokumentu, kalkulu orri eta aurkezpen fitxategi formatu nagusiak onartzen ditu eta arakatzaile moderno guztiekin batera funtzionatzen du.\n\nAplikazio honek zerbitzari integratua eskaintzen du Nextcloud Office dokumentuak editatzeko eginbide guztiekin. Instalatzeko erraza, erabilera pertsonalerako edo talde txikientzat. Zerbitzari autonomoa baino pixka bat motelagoa da eta eskalagarritasun ezaugarri aurreraturik gabekoa.\n\n**Sistemaren eskakizunak:**\n- ```x86-64``` edo ```arm64/aarch64``` plataforman exekutatzen ari den Linux\n- ```glibc``` liburutegian oinarritutako banaketa/edukiontzia (```musl libc``` **ez** dago onartura)\n- Fontconfig (```libfontconfig.so.1```)\n- Eskakizun gehiago [hemen](https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode) aurkitu daitezke\n\nDeskarga nahiko handia da, beraz, baliteke web-interfazea erabiltzean denbora ematea. OCC komando lerroaren tresna erabil dezakezu zerbitzari integratua instalatzeko:\n\n...\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n...\nNon `wwwrun` zure web zerbitzariaren erabiltzailea den. Hau da \"www-data\" Debian, Ubuntu eta deribatuetan, \"wwwrun\" SUSEn oinarritutako banaketetan, \"apache\" Red Hat / Fedora-n eta \"http\" Arch linux eta deribatuetan.\n\nEguneratzeak honela egin daitezke:\n...\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nJakina, bestela memoriaren erabilera eta PHP denbora-mugak handitu ditzakezu modu lehenetsian, ikusi [Nextcloud dokumentazioa.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)\n\nArazoak konpontzeko aholku gehiago aurki daitezke [hemen](https://github.com/CollaboraOnline/rich-entscode?tab=readme-ov-file#troubleshooting).",
    "Your system is ARM64, but you have installed the x86_64 version of the app. Please remove this and" : "Zure sistema ARM64 da, baina aplikazioaren x86_64 bertsioa instalatu duzu. Kendu hau eta",
    "install the correct version from the Nextcloud App Store." : "Instalatu bertsio zuzena Nextclouden Aplikazioen Biltegitik.",
    "Your system is x86_64, but you have installed the ARM64 version of the app. Please remove this and" : "Zure sistema x86_64 da, baina aplikazioaren ARM64 bertsioa instalatu duzu. Kendu hau eta",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "Collabora Online aplikazioa gaituta duzu. Informazio eta konfigurazio gehiagorako, egiaztatu:",
    "Administration settings > Nextcloud Office" : "Administrazio ezarpenak > Nextcloud Office",
    "The Built-in CODE Server is designed to work with the Nextcloud Office app." : "CODE zerbitzari integratua Nextcloud Office aplikazioarekin lan egiteko diseinatuta dago.",
    "Install it from the Nextcloud App Store." : "Instalatu Nextclouden Aplikazioen Biltegitik.",
    "An error occurred while trying to check your Collabora Online app installation. You may report this error\n                with the tag: <em>richdocuments-EnabledCheckFailed</em>" : "Errore bat gertatu da Collabora Online aplikazioaren instalazioa egiaztatzen saiatzean. Akats honen berri eman dezakezu\n                      etiketa honekin: <em>richdocuments- EnabledCheckFailed</em>"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}