{ "translations": {
    "Built-in CODE Server" : "Insuite i Freastalaí CÓD",
    "Collabora Online - Built-in CODE Server" : "Collabora Online - Built-in CODE Server",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "Freastalaí Collabora Online Development Edition (CODE) ionsuite le haghaidh úsáide áitiúla tástála agus neamhtháirgthe",
    "**This app has to be installed and used together with the [Nextcloud Office](https://apps.nextcloud.com/apps/richdocuments) integration app.**\n\nCollabora Online is a powerful LibreOffice-based online office suite with collaborative editing, which supports all major documents, spreadsheet and presentation file formats and works together with all modern browsers.\n\n* This app provides a built-in server with all of the document editing features of Collabora Online.\n* Easy to install, for personal use or for small teams.\n* A bit slower than a standalone server and without the advanced scalability features.\n\n**System Requirements:**\n- Linux running on ```x86-64``` or ```arm64/aarch64```\n- A ```glibc``` based distribution/container (```musl libc``` is **not** supported)\n- Fontconfig (```libfontconfig.so.1```)\n- Additional requirements can be found in [here](https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n\n*The download is rather big so it is possible you will experience a time-out when installing via the web interface.* You can use the OCC command install the built-in server from the command-line instead:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nWhere `wwwrun` is the user of your web server. This is ```www-data``` on Debian, Ubuntu and derivatives, `wwwrun` on SUSE based distributions, `apache` on Red Hat/Fedora and `http` on Arch linux and derivatives.\n\nUpdates can be done like this:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nOf course, alternatively you could increase memory usage and PHP time-outs by default, see the [Nextcloud documentation.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)\n\nAdditional troubleshooting tips can be found [here](https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting)." : "**Ní mór an aip seo a shuiteáil agus a úsáid in éineacht leis an aip lánpháirtithe [Nextcloud Office](https://apps.nextcloud.com/apps/richdocuments).**\n\nIs sraith chumhachtach oifige ar líne é Collabora Online atá bunaithe ar LibreOffice le heagarthóireacht chomhoibríoch, a thacaíonn le gach mórdhoiciméad, scarbhileog agus formáid comhaid léirithe agus a oibríonn le chéile le gach brabhsálaí nua-aimseartha.\n\n* Soláthraíonn an aip seo freastalaí ionsuite leis na gnéithe eagarthóireachta doiciméad go léir de Collabora Online.\n* Éasca le suiteáil, le haghaidh úsáide pearsanta nó le haghaidh foirne beaga.\n* Beagán níos moille ná freastalaí neamhspleách agus gan na gnéithe inscálaitheachta chun cinn.\n\n**Riachtanais Chórais:**\n- Linux ag rith ar `` x86-64``` nó `` arm64 / aarch64``\n- Dáileadh/coimeádán bunaithe ar ``` glibc`` (ní thacaítear le ``` musl libc``` **)\n- Fontconfig (```libfontconfig.so.1```)\n- Is féidir ceanglais bhreise a fháil in [anseo]( https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n\n*Tá an t-íoslódáil sách mór agus mar sin is féidir go mbeidh am saor agat agus tú ag suiteáil tríd an gcomhéadan gréasáin.* Is féidir leat an t-ordú OCC a úsáid chun an freastalaí ionsuite a shuiteáil ón líne ordaithe ina ionad sin:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app: suiteáil richdocumentscode\n```\nÁit a bhfuil `wwwrun` mar úsáideoir do fhreastalaí gréasáin. Seo ``www-data``` ar Debian, Ubuntu agus díorthaigh, `wwwrun` ar dháiltí bunaithe ar SUSE, `apache` ar Red Hat/Fedora agus `http` ar Arch linux agus díorthaigh.\n\nIs féidir nuashonruithe a dhéanamh mar seo:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app: nuashonraigh --all\n```\n\nAr ndóigh, mar mhalairt air sin d’fhéadfá úsáid chuimhne agus amanna ama PHP a mhéadú de réir réamhshocraithe, féach ar an [doiciméadúchán Nextcloud.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)\n\nIs féidir leideanna fabhtcheartaithe breise a fháil [anseo]( https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting).",
    "Your system is ARM64, but you have installed the x86_64 version of the app. Please remove this and" : "Is é ARM64 do chóras, ach tá an leagan x86_64 den aip suiteáilte agat. Bain é seo le do thoil agus",
    "install the correct version from the Nextcloud App Store." : "install the correct version from the Nextcloud Siopa Aip.",
    "Your system is x86_64, but you have installed the ARM64 version of the app. Please remove this and" : "Is é x86_64 do chóras, ach tá an leagan ARM64 den aip suiteáilte agat. Bain é seo le do thoil agus",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "Tá an aip Collabora Online cumasaithe agat. Le haghaidh tuilleadh faisnéise agus cumraíochta, seiceáil le do thoil:",
    "Administration settings > Nextcloud Office" : "Socruithe riaracháin > Oifig Nextcloud",
    "The Built-in CODE Server is designed to work with the Nextcloud Office app." : "Tá an Freastalaí CÓD Insuite deartha chun oibriú leis an aip Oifig Nextcloud.",
    "Install it from the Nextcloud App Store." : "Suiteáil é ón Nextcloud Siopa Aip.",
    "An error occurred while trying to check your Collabora Online app installation. You may report this error\n                with the tag: <em>richdocuments-EnabledCheckFailed</em>" : "Tharla earráid agus tú ag iarraidh do shuiteáil aip Collabora Online a sheiceáil. Is féidir leat an earráid seo a thuairisciú\n                leis an gclib: <em>richdocuments-EnabledCheckFailed</em>"
},"pluralForm" :"nplurals=5; plural=(n==1 ? 0 : n==2 ? 1 : n<7 ? 2 : n<11 ? 3 : 4);"
}