{ "translations": {
    "Built-in CODE Server" : "Ugrađeni poslužitelj CODE",
    "Collabora Online - Built-in CODE Server" : "Collabora Online – ugrađeni poslužitelj CODE",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "Ugrađeni poslužitelj „Built-in Collabora Online Development Edition (CODE)” za lokalno testiranje i uporabu izvan produkcijske okoline",
    "**This app has to be installed and used together with the [Nextcloud Office](https://apps.nextcloud.com/apps/richdocuments) integration app.**\n\nCollabora Online is a powerful LibreOffice-based online office suite with collaborative editing, which supports all major documents, spreadsheet and presentation file formats and works together with all modern browsers.\n\n* This app provides a built-in server with all of the document editing features of Collabora Online.\n* Easy to install, for personal use or for small teams.\n* A bit slower than a standalone server and without the advanced scalability features.\n\n**System Requirements:**\n- Linux running on ```x86-64``` or ```arm64/aarch64```\n- A ```glibc``` based distribution/container (```musl libc``` is **not** supported)\n- Fontconfig (```libfontconfig.so.1```)\n- Additional requirements can be found in [here](https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n\n*The download is rather big so it is possible you will experience a time-out when installing via the web interface.* You can use the OCC command install the built-in server from the command-line instead:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nWhere `wwwrun` is the user of your web server. This is ```www-data``` on Debian, Ubuntu and derivatives, `wwwrun` on SUSE based distributions, `apache` on Red Hat/Fedora and `http` on Arch linux and derivatives.\n\nUpdates can be done like this:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nOf course, alternatively you could increase memory usage and PHP time-outs by default, see the [Nextcloud documentation.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)\n\nAdditional troubleshooting tips can be found [here](https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting)." : "**Ovu aplikaciju potrebno je instalirati i koristiti zajedno s integracijskom aplikacijom [Nextcloud Office](https://apps.nextcloud.com/apps/richdocuments) **\n\nCollabora Online je moćan mrežni uredski paket temeljen na LibreOfficeu s kolaborativnim uređivanjem, koji podržava sve glavne formate dokumenata, proračunskih tablica i prezentacija te radi u svim modernim preglednicima.\n\n* Ova aplikacija pruža ugrađeni poslužitelj sa svim funkcijama uređivanja dokumenata koje nudi Collabora Online.\n* Jednostavna instalacija, za osobnu upotrebu ili za male timove.\n* Nešto sporija od samostalnog poslužitelja i bez naprednih značajki skalabilnosti.\n\n**Sistemski zahtjevi:**\n- Linux na \"x86-64\" ili \"arm64/aarch64\"\n- Distribucija/spremnik temeljen na \"glibc\"-u (\"musl libc\" **nije** podržan) \n- Fontconfig (\"libfontconfig.so.1\")\n- Dodatni zahtjevi dostupni su [ovdje](https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n\n*Preuzimanje je prilično veliko pa je moguće da ćete prilikom instalacije putem web sučelja naići na prekoračenje vremena. Umjesto toga možete koristiti OCC naredbu za instalaciju ugrađenog poslužitelja iz naredbenog retka:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\ngdje je wwwrun korisnik vašeg web-poslužitelja. To je www-data na Debianu, Ubuntuu i izvedenicama, wwwrun na SUSE distribucijama, apache na Red Hat/Fedora sustavima te http na Arch Linuxu i izvedenicama.\nAžuriranja se mogu izvršiti ovako:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nNaravno, alternativno možete povećati ograničenja memorije i PHP vremenska ograničenja prema zadanim postavkama; pogledajte [Nextcloud dokumentaciju.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)\n\nDodatni savjeti za rješavanje problema dostupni su [ovdje](https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting).",
    "Your system is ARM64, but you have installed the x86_64 version of the app. Please remove this and" : "Vaš sustav ima arhitekturu ARM64, ali instalirali ste inačicu aplikacije za x86_64. Uklonite je i",
    "install the correct version from the Nextcloud App Store." : "instalirajte točnu inačicu iz trgovine Nextcloud App Store.",
    "Your system is x86_64, but you have installed the ARM64 version of the app. Please remove this and" : "Vaš sustav ima arhitekturu x86_64, ali instalirali ste inačicu aplikacije za ARM64. Uklonite je i",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "Omogućena je aplikacija Collabora Online. Za više informacija o konfiguraciji pogledajte:",
    "Administration settings > Nextcloud Office" : "Administracijske postavke > Nextcloud Office",
    "The Built-in CODE Server is designed to work with the Nextcloud Office app." : "Ugrađeni CODE poslužitelj osmišljen je za rad s aplikacijom Nextcloud Office.",
    "Install it from the Nextcloud App Store." : "Instalirajte iz trgovine Nextcloud App Store.",
    "An error occurred while trying to check your Collabora Online app installation. You may report this error\n                with the tag: <em>richdocuments-EnabledCheckFailed</em>" : "Došlo je do pogreške pri provjeri vaše instalacije aplikacije Collabora Online. Prijavite pogrešku\n               koristeći se oznakom: <em>richdocuments-EnabledCheckFailed</em>"
},"pluralForm" :"nplurals=3; plural=n%10==1 && n%100!=11 ? 0 : n%10>=2 && n%10<=4 && (n%100<10 || n%100>=20) ? 1 : 2;"
}