{ "translations": {
    "Built-in CODE Server" : "Beépített CODE-kiszolgáló",
    "Collabora Online - Built-in CODE Server" : "Collabora Online – Beépített CODE-kiszolgáló",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "Beépített Collabora Online Development Edition (CODE) kiszolgáló helyi teszteléshez és nem éles használathoz",
    "This app has to be installed and used together with the **[Collabora Online](https://apps.nextcloud.com/apps/richdocuments)** app.\n\nCollabora Online is a powerful LibreOffice-based online office suite with collaborative editing, which supports all major documents, spreadsheet and presentation file formats and works together with all modern browsers.\n\nThis app provides a built-in server with all of the document editing features of Collabora Online. Easy to install, for personal use or for small teams. A bit slower than a standalone server and without the advanced scalability features." : "Ezt az alkalmazást a **[Collabora Online](https://apps.nextcloud.com/apps/richdocuments)** alkalmazással együtt kell telepíteni és használni.\n\nA Collabora Online egy sokoldalú, LibreOffice-on alapuló online irodai programcsomag, amely lehetővé teszi az elterjedt dokumentumformátumok – szöveges dokumentumok, munkafüzetek, bemutatók – szerkesztését, akár egyszerre több szerkesztő számára is. Minden modern böngészővel kompatibilis.\n\nEz az alkalmazás egy beépített kiszolgálót tartalmaz, a Collabora Online minden funkciója elérhető. A telepítése egyszerű, otthoni használatra vagy kis csoportoknak alkalmas. A különálló kiszolgálónál egy kicsit lassabb, és nem skálázható.",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "A Collabora Online alkalmazás engedélyezve van. A további információkért és beállítási lehetőségekért ugorjon ide:",
    "Settings > Administration > Collabora Online" : "Beállítások > Adminisztráció > Collabora Online",
    "Built-in CODE server is designed to work with the usual Collabora Online app." : "A beépített CODE-kiszolgáló a szokásos Collabora Online alkalmazással együtt használható.",
    "Install it from the Nextcloud App Store." : "Telepítse a Nexcloud App Store-ból.",
    "An error occurred while trying to check your Collabora Online app installation. You may report this error\n                with the tag: <em>richdocuments-EnabledCheckFailed</em>" : "Hiba történt a Collabora Online alkalmazás telepítésének ellenőrzése közben. A hibát bejelentheti a\n                <em>richdocuments-EnabledCheckFailed</em> címkével."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}