{ "translations": {
    "Built-in CODE Server" : "Beépített CODE-kiszolgáló",
    "Collabora Online - Built-in CODE Server" : "Collabora Online – Beépített CODE-kiszolgáló",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "Beépített Collabora Online Development Edition (CODE) kiszolgáló helyi teszteléshez és nem éles használathoz",
    "This app has to be installed and used together with the **[Collabora Online](https://apps.nextcloud.com/apps/richdocuments)** app.\n\nCollabora Online is a powerful LibreOffice-based online office suite with collaborative editing, which supports all major documents, spreadsheet and presentation file formats and works together with all modern browsers.\n\nThis app provides a built-in server with all of the document editing features of Collabora Online. Easy to install, for personal use or for small teams. A bit slower than a standalone server and without the advanced scalability features.\n\nThe download is rather big so it is possible you experience a time-out when using the web interface. You can use the OCC command line tool to install the built-in server:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nWhere `wwwrun` is the user of your web server. This is ```www-data``` on Debian, Ubuntu and derivatives, `wwwrun` on SUSE based distributions, `apache` on Red Hat/Fedora and `http` on Arch linux and derivatives.\n\nUpdates can be done like this:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nOf course, alternatively you could increase memory usage and PHP time-outs by default, see the [Nextcloud documentation.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)" : "Ezt az alkalmazást a **[Collabora Online](https://apps.nextcloud.com/apps/richdocuments)** alkalmazással együtt kell telepíteni és használni.\n\nA Collabora Online egy hatékony LibreOffice-alapú, közös szerkesztést biztosító online irodai programcsomag, amely támogatja az összes fontosabb dokumentum-, táblázat- és prezentációs fájlformátumot, és együttműködik az összes modern böngészővel.\n\nEz az alkalmazás beépített kiszolgálót biztosít a Collabora Online összes dokumentumszerkesztő funkciójával. Könnyen telepíthető, személyes használatra vagy kis csapatok számára. Kicsit lassabb, mint egy önálló kiszolgáló, és a hiányoznak belőle fejlett skálázhatósági funkciók.\n\nA letöltés meglehetősen nagy, így előfordulhat, hogy időtúllépést tapasztal a webes felület használatakor. Az OCC parancssori eszközzel telepítheti a beépített kiszolgálót:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nAhol a `wwwrun` a webkiszolgáló felhasználója. Ez Debianon, Ubuntun és azok származékain ```www-data```, a SUSE alapú disztribúciókon `wwwrun`, Red Haten és Fedorán `apache`, Arch Linuxon és származékain pedig `http`.\n\nA frissítéseket így lehet elvégezni:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nTermészetesen alternatívaként megnövelheti a memóriahasználat értékét és a PHP időtúllépéseit is, lásd a [Nextcloud dokumentációját](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)",
    "Your system is ARM64, but you have installed the x86_64 version of the app. Please remove this and" : "Az Ön rendszere ARM64, de az x86_64-re való csomagot telepítette. Kérjük, ezt távolítsa el, és",
    "install the correct version from the Nextcloud App Store." : "telepítse a megfelelő verziót a Nextcloud alkalmazásboltjából.",
    "Your system is x86_64, but you have installed the ARM64 version of the app. Please remove this and" : "Az Ön rendszere x86_64, de az ARM64-re való csomagot telepítette. Kérjük, ezt távolítsa el, és",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "A Collabora Online alkalmazás engedélyezve van. A további információkért és beállítási lehetőségekért ugorjon ide:",
    "Settings > Administration > Collabora Online" : "Beállítások > Adminisztráció > Collabora Online",
    "Built-in CODE server is designed to work with the usual Collabora Online app." : "A beépített CODE-kiszolgáló a szokásos Collabora Online alkalmazással együtt használható.",
    "Install it from the Nextcloud App Store." : "Telepítse a Nextcloud alkalmazásboltból.",
    "An error occurred while trying to check your Collabora Online app installation. You may report this error\n                with the tag: <em>richdocuments-EnabledCheckFailed</em>" : "Hiba történt a Collabora Online alkalmazás telepítésének ellenőrzése közben. A hibát bejelentheti a\n                <em>richdocuments-EnabledCheckFailed</em> címkével."
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}