{ "translations": {
    "Built-in CODE Server" : "Server CODE bawaan",
    "Collabora Online - Built-in CODE Server" : "Collabora Online - Server CODE Bawaan",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "Server bawaan Collabora Online Development Edition (CODE) untuk pengujian lokal dan penggunaan non-produksi",
    "**This app has to be installed and used together with the [Nextcloud Office](https://apps.nextcloud.com/apps/richdocuments) integration app.**\n\nCollabora Online is a powerful LibreOffice-based online office suite with collaborative editing, which supports all major documents, spreadsheet and presentation file formats and works together with all modern browsers.\n\n* This app provides a built-in server with all of the document editing features of Collabora Online.\n* Easy to install, for personal use or for small teams.\n* A bit slower than a standalone server and without the advanced scalability features.\n\n**System Requirements:**\n- Linux running on ```x86-64``` or ```arm64/aarch64```\n- A ```glibc``` based distribution/container (```musl libc``` is **not** supported)\n- Fontconfig (```libfontconfig.so.1```)\n- Additional requirements can be found in [here](https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n\n*The download is rather big so it is possible you will experience a time-out when installing via the web interface.* You can use the OCC command install the built-in server from the command-line instead:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nWhere `wwwrun` is the user of your web server. This is ```www-data``` on Debian, Ubuntu and derivatives, `wwwrun` on SUSE based distributions, `apache` on Red Hat/Fedora and `http` on Arch linux and derivatives.\n\nUpdates can be done like this:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nOf course, alternatively you could increase memory usage and PHP time-outs by default, see the [Nextcloud documentation.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)\n\nAdditional troubleshooting tips can be found [here](https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting)." : "**Aplikasi ini harus dipasang dan digunakan bersama aplikasi integrasi [Nextcloud Office](https://apps.nextcloud.com/apps/richdocuments).**\n\nCollabora Online adalah suite office online yang andal berbasis LibreOffice dengan pengeditan kolaboratif, yang mendukung semua format berkas dokumen, spreadsheet, dan presentasi utama serta bekerja bersama semua peramban modern.\n\n* Aplikasi ini menyediakan server bawaan dengan semua fitur pengeditan dokumen dari Collabora Online.\n* Mudah dipasang, untuk penggunaan pribadi atau tim kecil.\n* Sedikit lebih lambat daripada server mandiri dan tanpa fitur skalabilitas lanjutan.\n\n**Persyaratan Sistem:**\n- Linux yang berjalan di ```x86-64``` atau ```arm64/aarch64```\n- Distribusi/kontainer berbasis ```glibc``` (```musl libc``` **tidak** didukung)\n- Fontconfig (```libfontconfig.so.1```)\n- Persyaratan tambahan dapat ditemukan [di sini](https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n\n*Unduhannya cukup besar sehingga Anda mungkin mengalami time-out saat memasang melalui antarmuka web.* Anda dapat menggunakan perintah OCC untuk memasang server bawaan dari command-line sebagai gantinya:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nDi mana `wwwrun` adalah user server web Anda. Ini adalah ```www-data``` pada Debian, Ubuntu dan turunannya, `wwwrun` pada distribusi berbasis SUSE, `apache` pada Red Hat/Fedora dan `http` pada Arch linux dan turunannya.\n\nPembaruan dapat dilakukan seperti ini:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nTentu saja, sebagai alternatif Anda dapat meningkatkan penggunaan memori dan PHP time-out secara default, lihat [dokumentasi Nextcloud.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)\n\nKiat pemecahan masalah tambahan dapat ditemukan [di sini](https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting).",
    "Your system is ARM64, but you have installed the x86_64 version of the app. Please remove this and" : "Sistem Anda adalah ARM64, tetapi Anda telah memasang versi aplikasi x86_64. Harap hapus ini dan",
    "install the correct version from the Nextcloud App Store." : "pasang versi yang benar dari Nextcloud App Store.",
    "Your system is x86_64, but you have installed the ARM64 version of the app. Please remove this and" : "Sistem Anda adalah x86_64, tetapi Anda telah memasang versi aplikasi ARM64. Harap hapus ini dan",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "Anda mengaktifkan aplikasi Collabora Online. Untuk informasi dan konfigurasi lebih lanjut, silakan periksa:",
    "Administration settings > Nextcloud Office" : "Pengaturan administrasi > Nextcloud Office",
    "The Built-in CODE Server is designed to work with the Nextcloud Office app." : "Server CODE bawaan dirancang untuk bekerja dengan aplikasi Nextcloud Office.",
    "Install it from the Nextcloud App Store." : "Pasang dari Nextcloud App Store.",
    "An error occurred while trying to check your Collabora Online app installation. You may report this error\n                with the tag: <em>richdocuments-EnabledCheckFailed</em>" : "Terjadi kesalahan saat mencoba memeriksa instalasi aplikasi Collabora Online Anda. Anda dapat melaporkan kesalahan ini\n                dengan tag: <em>richdocuments-EnabledCheckFailed</em>"
},"pluralForm" :"nplurals=1; plural=0;"
}