{ "translations": {
    "Built-in CODE Server" : "Server CODE integrato",
    "Collabora Online - Built-in CODE Server" : "Collabora Online - Server CODE integrato",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "Server integrato Collabora Online Development Edition (CODE) per test locali e utilizzo non di produzione",
    "This app has to be installed and used together with the **[Collabora Online](https://apps.nextcloud.com/apps/richdocuments)** app.\n\nCollabora Online is a powerful LibreOffice-based online office suite with collaborative editing, which supports all major documents, spreadsheet and presentation file formats and works together with all modern browsers.\n\nThis app provides a built-in server with all of the document editing features of Collabora Online. Easy to install, for personal use or for small teams. A bit slower than a standalone server and without the advanced scalability features." : "Questa applicazione deve essere installata e utilizzata assieme all'applicazione **[Collabora Online](https://apps.nextcloud.com/apps/richdocuments)** . \n\nCollabora Online è una potente suite da ufficio basata su LibreOffice con funzionalità di modifica collaborativa, supporto dei principali formati di documenti, tabelle e presentazioni ed è in grado di funzionare con tutti i browser moderni.\n\nQuesta applicazione mette a disposizione un server interno con tutte le funzionalità di modifica dei documenti di Collabora Online. Semplice da installare, per uso personale o piccoli gruppi. È leggermente più lenta del server autonomo e priva delle funzionalità di scalabilità avanzata. ",
    "Your system is ARM64, but you have installed the x86_64 version of the app. Please remove this and" : "Il tuo sistema è ARM64, ma hai installato la versione x86_54 dell'applicazione. Rimuovila e",
    "install the correct version from the Nextcloud App Store." : "Installa la versione corretta dal negozio di applicazioni di Nextcloud.",
    "Your system is x86_64, but you have installed the ARM64 version of the app. Please remove this and" : "Il tuo sistema è x86_64, ma hai installato la versione ARM64 dell'applicazione. Rimuovila e",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "L'applicazione Collabora Online è abilitata. Per ulteriori informazioni e configurazioni, controlla:",
    "Settings > Administration > Collabora Online" : "Impostazioni > Amministrazione > Collabora Online",
    "Built-in CODE server is designed to work with the usual Collabora Online app." : "Il server CODE integrato è progettato per funzionare con la normale applicazione Collabora Online.",
    "Install it from the Nextcloud App Store." : "Installalo dal negozio di applicazioni di Nextcloud.",
    "An error occurred while trying to check your Collabora Online app installation. You may report this error\n                with the tag: <em>richdocuments-EnabledCheckFailed</em>" : "Si è verificato un errore durante la verifica della tua installazione di Collabora Online. Puoi segnalare questo errore\n                con l'etichetta: <em>richdocuments-EnabledCheckFailed</em>"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}