{ "translations": {
    "Built-in CODE Server" : "Ingebouwde CODE-Server",
    "Collabora Online - Built-in CODE Server" : "Collabora Online - Ingebouwde CODE-Server",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "Ingebouwde Collabora Online Development Edition (CODE) server voor lokale testing en non-productie gebruik",
    "This app has to be installed and used together with the **[Collabora Online](https://apps.nextcloud.com/apps/richdocuments)** app.\n\nCollabora Online is a powerful LibreOffice-based online office suite with collaborative editing, which supports all major documents, spreadsheet and presentation file formats and works together with all modern browsers.\n\nThis app provides a built-in server with all of the document editing features of Collabora Online. Easy to install, for personal use or for small teams. A bit slower than a standalone server and without the advanced scalability features." : "Deze app moet worden geïnstalleerd en gebruikt samen met de ** [Collabora Online] (https://apps.nextcloud.com/apps/richdocuments) ** app.\n\nCollabora Online is een krachtige op LibreOffice gebaseerde online kantoorsuite met gezamenlijke bewerking, die alle belangrijke document-, spreadsheet- en presentatiebestandsindelingen ondersteunt en samenwerkt met alle moderne browsers.\n\nDeze app biedt een ingebouwde server met alle documentbewerkingsfuncties van Collabora Online. Eenvoudig te installeren, voor persoonlijk gebruik of voor kleine teams. Een beetje langzamer dan een stand-alone server en zonder de geavanceerde schaalbaarheidsfuncties.",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "Je hebt de Collabora Online app ingeschakeld. Voor meer informatie een configuratie, gelieve te gaan naar:",
    "Settings > Administration > Collabora Online" : "Instellingen > Administratie > Collabora Online",
    "Built-in CODE server is designed to work with the usual Collabora Online app." : "Ingebouwde CODE-server is gemaakt om samen te werken met de gewone Collabora Online app.",
    "Install it from the Nextcloud App Store." : "Installeer het vanaf de Nextcloud App Store.",
    "An error occurred while trying to check your Collabora Online app installation. You may report this error\n                with the tag: <em>richdocuments-EnabledCheckFailed</em>" : "Er is een fout opgetreden bij het controleren van de installatie van uw Collabora Online-app. U kunt deze fout melden\nmet dit label: <em>richdocuments-EnabledCheckFailed</em>"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}