{ "translations": {
    "Built-in CODE Server" : "Wbudowany serwer CODE",
    "Collabora Online - Built-in CODE Server" : "Collabora Online - Wbudowany serwer CODE",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "Wbudowany serwer Collabora Online Development Edition (CODE) do testowania lokalnego i do użytku nieprodukcyjnego",
    "**This app has to be installed and used together with the [Nextcloud Office](https://apps.nextcloud.com/apps/richdocuments) integration app.**\n\nCollabora Online is a powerful LibreOffice-based online office suite with collaborative editing, which supports all major documents, spreadsheet and presentation file formats and works together with all modern browsers.\n\n* This app provides a built-in server with all of the document editing features of Collabora Online.\n* Easy to install, for personal use or for small teams.\n* A bit slower than a standalone server and without the advanced scalability features.\n\n**System Requirements:**\n- Linux running on ```x86-64``` or ```arm64/aarch64```\n- A ```glibc``` based distribution/container (```musl libc``` is **not** supported)\n- Fontconfig (```libfontconfig.so.1```)\n- Additional requirements can be found in [here](https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n\n*The download is rather big so it is possible you will experience a time-out when installing via the web interface.* You can use the OCC command install the built-in server from the command-line instead:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nWhere `wwwrun` is the user of your web server. This is ```www-data``` on Debian, Ubuntu and derivatives, `wwwrun` on SUSE based distributions, `apache` on Red Hat/Fedora and `http` on Arch linux and derivatives.\n\nUpdates can be done like this:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nOf course, alternatively you could increase memory usage and PHP time-outs by default, see the [Nextcloud documentation.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)\n\nAdditional troubleshooting tips can be found [here](https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting)." : "** Ta aplikacja musi być zainstalowana i używana razem z aplikacją integracyjną Nextcloud Office (https://apps.nextcloud.com/apps/richdocuments).**\n\nCollabora Online to potężny pakiet biurowy online oparty na LibreOffice, obsługujący współpracę przy dokumentach, arkuszach kalkulacyjnych i prezentacjach, który działa ze wszystkimi nowoczesnymi przeglądarkami.\n\n* Ta aplikacja udostępnia wbudowany serwer ze wszystkimi funkcjami edycji dokumentów Collabora Online.\n* Łatwa do zainstalowania, do użytku osobistego lub dla małych zespołów. \n* Nieco wolniejsza niż samodzielny serwer i bez zaawansowanych funkcji skalowalności.\n\n**Wymagania systemowe:*\n- Linux działający na „x86-64” lub „arm64/aarch64”\n- Dystrybucja oparta na „glibc”/kontener (nieobsługiwane: „musl libc”)\n- Fontconfig („libfontconfig.so.1”)\n\nDodatkowe wymagania można znaleźć tutaj (https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n\nUwaga: plik do pobrania jest dość duży, więc możliwe, że przy instalacji przez interfejs WWW wystąpi przekroczenie limitu czasu. Możesz użyć polecenia OCC do instalacji wbudowanego serwera z linii poleceń zamiast tego:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nOczywiście alternatywnie możesz zwiększyć domyślny limit pamięci i czasów oczekiwania PHP — szczegóły w dokumentacji Nextcloud (https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=phpmeout#configuring-your-web-server)\n\nDodatkowe wskazówki dotyczące rozwiązywania problemów znajdziesz tutaj (https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting).",
    "Your system is ARM64, but you have installed the x86_64 version of the app. Please remove this and" : "Twój system to ARM64, a masz zainstalowaną wersję aplikacji x86_64. Usuń to i",
    "install the correct version from the Nextcloud App Store." : "zainstaluj odpowiednią wersję z Nextcloud App Store.",
    "Your system is x86_64, but you have installed the ARM64 version of the app. Please remove this and" : "Twój system to x86_64, a masz zainstalowaną wersję aplikacji ARM64. Usuń to i",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "Masz włączoną aplikację Collabora Online. Aby uzyskać dodatkowe informacje oraz konfigurację, sprawdź:",
    "Administration settings > Nextcloud Office" : "Ustawienia administracyjne > Nextcloud Office",
    "The Built-in CODE Server is designed to work with the Nextcloud Office app." : "Wbudowany serwer CODE jest zaprojektowany do współpracy z aplikacją Nextcloud Office.",
    "Install it from the Nextcloud App Store." : "Zainstaluj z Nextcloud App Store.",
    "An error occurred while trying to check your Collabora Online app installation. You may report this error\n                with the tag: <em>richdocuments-EnabledCheckFailed</em>" : "Wystąpił błąd podczas próby sprawdzenia instalacji aplikacji Collabora Online. Możesz zgłosić ten błąd\n                z etykietą: <em>richdocuments-EnabledCheckFailed</em>"
},"pluralForm" :"nplurals=4; plural=(n==1 ? 0 : (n%10>=2 && n%10<=4) && (n%100<12 || n%100>14) ? 1 : n!=1 && (n%10>=0 && n%10<=1) || (n%10>=5 && n%10<=9) || (n%100>=12 && n%100<=14) ? 2 : 3);"
}