{ "translations": {
    "Built-in CODE Server" : "Встроенный CODE Server",
    "Collabora Online - Built-in CODE Server" : "Collabora Online - встроенный CODE Server",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "Встроенный Collabora Online Development Edition (CODE) сервер для локального тестирования и не производственного использования",
    "**This app has to be installed and used together with the [Nextcloud Office](https://apps.nextcloud.com/apps/richdocuments) integration app.**\n\nCollabora Online is a powerful LibreOffice-based online office suite with collaborative editing, which supports all major documents, spreadsheet and presentation file formats and works together with all modern browsers.\n\n* This app provides a built-in server with all of the document editing features of Collabora Online.\n* Easy to install, for personal use or for small teams.\n* A bit slower than a standalone server and without the advanced scalability features.\n\n**System Requirements:**\n- Linux running on ```x86-64``` or ```arm64/aarch64```\n- A ```glibc``` based distribution/container (```musl libc``` is **not** supported)\n- Fontconfig (```libfontconfig.so.1```)\n- Additional requirements can be found in [here](https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n\n*The download is rather big so it is possible you will experience a time-out when installing via the web interface.* You can use the OCC command install the built-in server from the command-line instead:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nWhere `wwwrun` is the user of your web server. This is ```www-data``` on Debian, Ubuntu and derivatives, `wwwrun` on SUSE based distributions, `apache` on Red Hat/Fedora and `http` on Arch linux and derivatives.\n\nUpdates can be done like this:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nOf course, alternatively you could increase memory usage and PHP time-outs by default, see the [Nextcloud documentation.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)\n\nAdditional troubleshooting tips can be found [here](https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting)." : "**Это приложение необходимо установить и использовать вместе с интеграционным приложением [Nextcloud Office](https://apps.nextcloud.com/apps/richdocuments).**\n\nCollabora Online — это мощный офисный пакет на основе LibreOffice с возможностью совместного редактирования, который поддерживает все основные форматы документов, электронных таблиц и презентаций и работает со всеми современными браузерами.\n\n* Это приложение предоставляет встроенный сервер со всеми функциями редактирования документов Collabora Online.\n* Легко устанавливается, подходит для личного использования или для небольших групп.\n\n* Немного медленнее, чем автономный сервер, и без расширенных функций масштабируемости.\n\n**Системные требования:**\n- Linux, работающий на ```x86-64``` или ```arm64/aarch64```\n- Дистрибутив/контейнер на основе ```glibc``` (```musl libc``` **не** поддерживается)\n- Fontconfig (```libfontconfig.so.1```)\n- Дополнительные требования можно найти [здесь](https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n\n*Загрузка довольно большая, поэтому при установке через веб-интерфейс может возникнуть тайм-аут.* Вместо этого вы можете использовать команду OCC для установки встроенного сервера из командной строки:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nГде `wwwrun` — пользователь вашего веб-сервера. Это ```www-data``` в Debian, Ubuntu и производных, `wwwrun` в дистрибутивах на основе SUSE, `apache` в Red Hat/Fedora и `http` в Arch Linux и производных.\n\nОбновления можно выполнить следующим образом:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nКонечно, в качестве альтернативы вы можете увеличить использование памяти и тайм-ауты PHP по умолчанию, см. [документацию Nextcloud.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=phpmeout#configuring-your-web-server)\n\nДополнительные советы по устранению неполадок можно найти [здесь](https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting).",
    "Your system is ARM64, but you have installed the x86_64 version of the app. Please remove this and" : "Вы используете систему на архитектуре ARM64, но установлена версия приложения для архитектуры x86_64. ",
    "install the correct version from the Nextcloud App Store." : "Вам необходимо удалить уставленную версию приложения и установить из магазина приложений версию, соответствующую архитектуре.",
    "Your system is x86_64, but you have installed the ARM64 version of the app. Please remove this and" : "Вы используете систему на архитектуре x86_64 но установлена версия приложения для архитектуры ARM64.",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "Вы включили Collabora Online app. Для дальнейшей информации и конфигурирования, пожалуйста, проверьте:",
    "Administration settings > Nextcloud Office" : "Настройки администрирования > Nextcloud Office",
    "The Built-in CODE Server is designed to work with the Nextcloud Office app." : "Встроенный сервер CODE предназначен для работы с приложением Nextcloud Office.",
    "Install it from the Nextcloud App Store." : "Установить это из Nextcloud App Store.",
    "An error occurred while trying to check your Collabora Online app installation. You may report this error\n                with the tag: <em>richdocuments-EnabledCheckFailed</em>" : "Возникла ошибка во время проверки установки Collabora Online app. Вы можете отправить отчёт об этой ошибке\n                с этим тэгом: <em>richdocuments-EnabledCheckFailed</em>"
},"pluralForm" :"nplurals=4; plural=(n%10==1 && n%100!=11 ? 0 : n%10>=2 && n%10<=4 && (n%100<12 || n%100>14) ? 1 : n%10==0 || (n%10>=5 && n%10<=9) || (n%100>=11 && n%100<=14)? 2 : 3);"
}