{ "translations": {
    "Built-in CODE Server" : "Встроенный CODE Server",
    "Collabora Online - Built-in CODE Server" : "Collabora Online - встроенный CODE Server",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "Встроенный Collabora Online Development Edition (CODE) сервер для локального тестирования и не производственного использования",
    "Your system is ARM64, but you have installed the x86_64 version of the app. Please remove this and" : "Вы используете систему на архитектуре ARM64, но установлена версия приложения для архитектуры x86_64. ",
    "install the correct version from the Nextcloud App Store." : "Вам необходимо удалить уставленную версию приложения и установить из магазина приложений версию, соответствующую архитектуре.",
    "Your system is x86_64, but you have installed the ARM64 version of the app. Please remove this and" : "Вы используете систему на архитектуре x86_64 но установлена версия приложения для архитектуры ARM64.",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "Вы включили Collabora Online app. Для дальнейшей информации и конфигурирования, пожалуйста, проверьте:",
    "Settings > Administration > Collabora Online" : "Настройки > Администрирование > Collabora Online",
    "Built-in CODE server is designed to work with the usual Collabora Online app." : "Встроенный CODE сервер создан для работы с обычным Collabora Online app.",
    "Install it from the Nextcloud App Store." : "Установить это из Nextcloud App Store.",
    "An error occurred while trying to check your Collabora Online app installation. You may report this error\n                with the tag: <em>richdocuments-EnabledCheckFailed</em>" : "Возникла ошибка во время проверки установки Collabora Online app. Вы можете отправить отчет об этой ошибке\n                с этим тэгом: <em>richdocuments-EnabledCheckFailed</em>"
},"pluralForm" :"nplurals=4; plural=(n%10==1 && n%100!=11 ? 0 : n%10>=2 && n%10<=4 && (n%100<12 || n%100>14) ? 1 : n%10==0 || (n%10>=5 && n%10<=9) || (n%100>=11 && n%100<=14)? 2 : 3);"
}