{ "translations": {
    "Built-in CODE Server" : "Seva ya CODE Iliyojengewa ndani",
    "Collabora Online - Built-in CODE Server" : "Shirikiana Mtandaoni - Seva ya Msimbo Iliyojengewa ndani",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "Seva Imejengwa ndani ya Toleo la Ukuzaji la Mtandao la Collabora (CODE) kwa ajili ya majaribio ya ndani na matumizi yasiyo ya uzalishaji",
    "**This app has to be installed and used together with the [Nextcloud Office](https://apps.nextcloud.com/apps/richdocuments) integration app.**\n\nCollabora Online is a powerful LibreOffice-based online office suite with collaborative editing, which supports all major documents, spreadsheet and presentation file formats and works together with all modern browsers.\n\n* This app provides a built-in server with all of the document editing features of Collabora Online.\n* Easy to install, for personal use or for small teams.\n* A bit slower than a standalone server and without the advanced scalability features.\n\n**System Requirements:**\n- Linux running on ```x86-64``` or ```arm64/aarch64```\n- A ```glibc``` based distribution/container (```musl libc``` is **not** supported)\n- Fontconfig (```libfontconfig.so.1```)\n- Additional requirements can be found in [here](https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n\n*The download is rather big so it is possible you will experience a time-out when installing via the web interface.* You can use the OCC command install the built-in server from the command-line instead:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nWhere `wwwrun` is the user of your web server. This is ```www-data``` on Debian, Ubuntu and derivatives, `wwwrun` on SUSE based distributions, `apache` on Red Hat/Fedora and `http` on Arch linux and derivatives.\n\nUpdates can be done like this:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nOf course, alternatively you could increase memory usage and PHP time-outs by default, see the [Nextcloud documentation.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)\n\nAdditional troubleshooting tips can be found [here](https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting)." : "**Programu hii lazima isakinishwe na kutumiwa pamoja na programu ya kuunganisha ya [Nextcloud](https://apps.nextcloud.com/apps/richdocuments).**\n\nCollabora Online ni ofisi ya mtandaoni yenye nguvu ya LibreOffice yenye uhariri wa shirikishi, ambayo inaauni hati kuu zote, lahajedwali na fomati za faili za uwasilishaji na inafanya kazi pamoja na vivinjari vyote vya kisasa.\n\n* Programu hii hutoa seva iliyojengewa ndani yenye vipengele vyote vya kuhariri hati vya Collabora Online.\n* Rahisi kusanikisha, kwa matumizi ya kibinafsi au kwa timu ndogo.\n* Polepole kidogo kuliko seva inayojitegemea na bila vipengele vya hali ya juu vya kuongeza kasi.\n\n**Mahitaji ya Mfumo:**\n- Linux inayoendesha ```x86-64``` au ```arm64/aarch64```\n- Usambazaji/chombo kulingana na ```glibc``` (```musl libc``` **haitumiki**)\n- Fontconfig (```libfontconfig.so.1```)\n- Mahitaji ya ziada yanaweza kupatikana katika [hapa](https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n \n*Upakuaji ni mkubwa kwa hivyo unaweza kupata uzoefu wa kuisha wakati wa kusakinisha kupitia kiolesura cha wavuti.* Unaweza kutumia amri ya OCC kusakinisha seva iliyojengewa ndani kutoka kwa safu ya amri badala yake:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nAmbapo `wwwrun` ni mtumiaji wa seva yako ya wavuti. Hii ni ```www-data``` juu ya Debian, Ubuntu na viini, `wwwrun` kwenye ugawaji unaotegemea SUSE, `apache` kwenye Red Hat/Fedora na `http` kwenye Arch linux na viasili.\n\nSasisho zinaweza kufanywa kama hii:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nBila shaka, vinginevyo unaweza kuongeza matumizi ya kumbukumbu na kukatika kwa muda kwa PHP kwa chaguo-msingi, angalia [Nextcloud documentation.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-server)\n\nVidokezo vya ziada vya utatuzi vinaweza kupatikana [hapa](https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting).",
    "Your system is ARM64, but you have installed the x86_64 version of the app. Please remove this and" : "Mfumo wako ni ARM64, lakini umesakinisha toleo la x86_64 la programu. Tafadhali ondoa hii na",
    "install the correct version from the Nextcloud App Store." : "sakinisha toleo sahihi kutoka kwa Nextcloud App Store.",
    "Your system is x86_64, but you have installed the ARM64 version of the app. Please remove this and" : "Mfumo wako ni x86_64, lakini umesakinisha toleo la ARM64 la programu. Tafadhali ondoa hii na",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "Umewasha programu ya Collabora Online. Kwa habari zaidi na usanidi, tafadhali angalia:",
    "Administration settings > Nextcloud Office" : "Mipangilio ya Utawala> Ofisi ya Nextcloud",
    "The Built-in CODE Server is designed to work with the Nextcloud Office app." : "Seva ya CODE Iliyojengewa ndani imeundwa kufanya kazi na programu ya Nextcloud Office.",
    "Install it from the Nextcloud App Store." : "Isakinishe kutoka kwa stoo ya Programu la Nextcloud",
    "An error occurred while trying to check your Collabora Online app installation. You may report this error\n                with the tag: <em>richdocuments-EnabledCheckFailed</em>" : "Hitilafu ilitokea wakati wa kujaribu kuangalia usakinishaji wa programu yako ya Collabora Online. Unaweza kuripoti hitilafu hii\nyenye lebo: <em>richdocuments-EnabledCheckFailed</em>"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}