{ "translations": {
    "Built-in CODE Server" : "Вбудований сервер CODE",
    "Collabora Online - Built-in CODE Server" : "Collabora Online - вбудований сервер CODE",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "Вбудований сервер Collabora Online Development Edition (CODE) для локального тестування та непродуктового використання",
    "**This app has to be installed and used together with the [Nextcloud Office](https://apps.nextcloud.com/apps/richdocuments) integration app.**\n\nCollabora Online is a powerful LibreOffice-based online office suite with collaborative editing, which supports all major documents, spreadsheet and presentation file formats and works together with all modern browsers.\n\n* This app provides a built-in server with all of the document editing features of Collabora Online.\n* Easy to install, for personal use or for small teams.\n* A bit slower than a standalone server and without the advanced scalability features.\n\n**System Requirements:**\n- Linux running on ```x86-64``` or ```arm64/aarch64```\n- A ```glibc``` based distribution/container (```musl libc``` is **not** supported)\n- Fontconfig (```libfontconfig.so.1```)\n- Additional requirements can be found in [here](https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n\n*The download is rather big so it is possible you will experience a time-out when installing via the web interface.* You can use the OCC command install the built-in server from the command-line instead:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nWhere `wwwrun` is the user of your web server. This is ```www-data``` on Debian, Ubuntu and derivatives, `wwwrun` on SUSE based distributions, `apache` on Red Hat/Fedora and `http` on Arch linux and derivatives.\n\nUpdates can be done like this:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nOf course, alternatively you could increase memory usage and PHP time-outs by default, see the [Nextcloud documentation.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)\n\nAdditional troubleshooting tips can be found [here](https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting)." : "**Цю програму необхідно встановити та використовувати разом з програмою інтеграції [Nextcloud Office](https://apps.nextcloud.com/apps/richdocuments).**\n\nCollabora Online — це потужний онлайн-офісний пакет на базі LibreOffice з функцією спільного редагування, який підтримує всі основні формати документів, електронних таблиць та презентацій і працює з усіма сучасними браузерами.\n\n* Ця програма надає вбудований сервер з усіма функціями редагування документів Collabora Online.\n* Проста в установці, для особистого використання або для невеликих команд.\n* Трохи повільніша, ніж автономний сервер, і без розширених функцій масштабування.\n\n**Системні вимоги:**\n- Linux, що працює на ```x86-64``` або ```arm64/aarch64```\n- Дистрибутив/контейнер на базі ```glibc``` (```musl libc``` **не** підтримується)\n- Fontconfig (```libfontconfig.so.1```)\n- Додаткові вимоги можна знайти [тут](https://github.com/CollaboraOnline/richdocumentscode#richdocumentscode)\n\n*Завантаження є досить великим, тому під час інсталяції через веб-інтерфейс можливе перевищення часу очікування.* Замість цього ви можете скористатися командою OCC для інсталяції вбудованого сервера з командного рядка:\n\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:install richdocumentscode\n```\nДе `wwwrun` — це користувач вашого веб-сервера. Це ```www-data``` на Debian, Ubuntu та похідних, `wwwrun` на дистрибутивах на базі SUSE, `apache` на Red Hat/Fedora та `http` на Arch linux та похідних.\n\nОновлення можна виконати таким чином:\n```\nsudo -u wwwrun php -d memory_limit=512M ./occ app:update --all\n```\n\nЗвичайно, як альтернативу, ви можете збільшити використання пам'яті та час очікування PHP за замовчуванням, див. [документацію Nextcloud.](https://docs.nextcloud.com/server/latest/admin_manual/configuration_files/big_file_upload_configuration.html?highlight=php%20timeout#configuring-your-web-server)\n\nДодаткові поради щодо усунення несправностей можна знайти [тут](https://github.com/CollaboraOnline/richdocumentscode?tab=readme-ov-file#troubleshooting).",
    "Your system is ARM64, but you have installed the x86_64 version of the app. Please remove this and" : "Ваша системи має архітектуру ARM64, але ви встановили версію застосунку для архітектури x86_64. Будь ласка, вилучіть його та",
    "install the correct version from the Nextcloud App Store." : "встановіть правильну версію з Nextcloud App Store.",
    "Your system is x86_64, but you have installed the ARM64 version of the app. Please remove this and" : "Ваша системи має архітектуру x86_64, але ви встановили версію застосунку для архітектури ARM64. Будь ласка, вилучіть його та",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "У вас увімкнено застосунок Collabora Online. Для отримання додаткової інформації та конфігурації, перегляньте",
    "Administration settings > Nextcloud Office" : "Адміністративні налаштування > Nextcloud Office",
    "The Built-in CODE Server is designed to work with the Nextcloud Office app." : "Вбудований сервер CODE призначено для роботи із застосунками Nextcloud Office.",
    "Install it from the Nextcloud App Store." : "Установіть його з Nextcloud App Store.",
    "An error occurred while trying to check your Collabora Online app installation. You may report this error\n                with the tag: <em>richdocuments-EnabledCheckFailed</em>" : "Під час спроби перевірки встановлення застосунку Collabora Online сталася помилка. Ви можете повідомити про цю помилку за допомогою мітки: <em>richdocuments-EnabledCheckFailed</em>"
},"pluralForm" :"nplurals=4; plural=(n % 1 == 0 && n % 10 == 1 && n % 100 != 11 ? 0 : n % 1 == 0 && n % 10 >= 2 && n % 10 <= 4 && (n % 100 < 12 || n % 100 > 14) ? 1 : n % 1 == 0 && (n % 10 ==0 || (n % 10 >=5 && n % 10 <=9) || (n % 100 >=11 && n % 100 <=14 )) ? 2: 3);"
}