{ "translations": {
    "Built-in CODE Server" : "内建服务器 (CODE)",
    "Collabora Online - Built-in CODE Server" : "在线协作 - 内建服务器 (CODE)",
    "Built-in Collabora Online Development Edition (CODE) server for local testing and non-production use" : "内建的在线协作开发版 (CODE) 服务器，用于本地测试和非生产用途",
    "This app has to be installed and used together with the **[Collabora Online](https://apps.nextcloud.com/apps/richdocuments)** app.\n\nCollabora Online is a powerful LibreOffice-based online office suite with collaborative editing, which supports all major documents, spreadsheet and presentation file formats and works together with all modern browsers.\n\nThis app provides a built-in server with all of the document editing features of Collabora Online. Easy to install, for personal use or for small teams. A bit slower than a standalone server and without the advanced scalability features." : "该应用必须与**[在线协作](https://apps.nextcloud.com/apps/richdocuments)**应用一起安装和使用。\n\n在线协作是基于 LibreOffice 的功能强大的在线办公套件，具有协作编辑功能，它支持所有主要文档、电子表格和演示文稿文件格式，并且可以与所有现代浏览器一起使用。\n\n该应用程序提供了内置服务器，具有在线协作的所有文档编辑功能。易于安装，可供个人使用或小型团队使用。但比独立服务器慢一点，且没有高级的可伸缩性功能。",
    "Your system is ARM64, but you have installed the x86_64 version of the app. Please remove this and" : "您的系统是 ARM64 架构，但是您已经安装了该应用程序的 x86_64 版本。请删除且",
    "install the correct version from the Nextcloud App Store." : "从 Nextcloud 应用商店安装正确的版本。",
    "Your system is x86_64, but you have installed the ARM64 version of the app. Please remove this and" : "您的系统是 x86_64 架构，但是您已经安装了该应用程序的 ARM64 版本。 请删除且",
    "You have the Collabora Online app enabled. For further information and configuration, please check:" : "您已启用在线协作应用。有关更多信息和配置，请参阅：",
    "Settings > Administration > Collabora Online" : "设置 > 管理 > 在线协作",
    "Built-in CODE server is designed to work with the usual Collabora Online app." : " 内建服务器 (CODE) 旨在与通用的在线协作应用一起使用。",
    "Install it from the Nextcloud App Store." : "从 Nextcloud 应用商店安装。",
    "An error occurred while trying to check your Collabora Online app installation. You may report this error\n                with the tag: <em>richdocuments-EnabledCheckFailed</em>" : "尝试检查您的在线协作应用安装时发生错误。 您可以报告此错误\n带有标签：<em>richdocuments-EnabledCheckFailed</em>"
},"pluralForm" :"nplurals=1; plural=0;"
}